{
  "title": "Commerce Disclosure",
  "effective": "Last updated: 2025-10-10",
  "backHome": "Back to home",

  "legalName": {
    "label": "Legal name",
    "value": "Kevin Matthew Collier (doing business as “Collier Consulting”)"
  },
  "head": {
    "label": "Head of operations",
    "value": "Kevin Matthew Collier"
  },
  "address": {
    "label": "Address",
    "value": "Will be disclosed without delay upon request.",
    "note": ""
  },
  "phone": {
    "label": "Phone number",
    "value": "070-9148-0521",
    "hours": "Support hours: Mon–Fri 10:00–18:00 JST (excl. public holidays)"
  },
  "email": {
    "label": "Email address",
    "value": "kevin.collier.consulting@gmail.com"
  },
  "url": {
    "label": "Website URL",
    "value": "https://english-kevin.com"
  },

  "price": {
    "label": "Price (incl. consumption tax)",
    "value": {
      "before": "See the ",
      "linkText": "pricing section",
      "after": " for session and package prices (all prices in JPY; fees include the post-session learning summary)."
    }
  },
  "fees": {
    "label": "Additional fees",
    "value": "No shipping or handling fees beyond the listed lesson prices. Administrative cancellation fees apply as stated in the refund policy below. For in-person sessions outside of Shibuya, Tamachi, and Shinagawa, additional transportation charges may apply."
  },
  "paymentMethods": {
    "label": "Accepted payment methods",
    "value": "Credit card (processed by Stripe), PayPay, and Cash (in-person lessons only)."
  },
  "paymentPeriod": {
    "label": "Payment period",
    "value": "Online lessons: please complete payment within 24 hours of booking to keep your spot (payment link provided by email). In-person lessons: pay online in advance or in cash on the day."
  },
  "delivery": {
    "label": "Delivery / service provision timing",
    "value": "Standard sessions (60 minutes) are provided online or in-person at the reserved date and time. Compact sessions (30 minutes) are only provided online at the reserved date and time."
  },

  "returns": {
    "title": "Exchanges & returns (refunds)",
    "customer": {
      "title": "Customer requests (non-defective)",
      "body": "Single lessons — Cancel >48h before: refund minus a ¥500 cancellation/admin fee (free reschedule also available). Cancel 24–48h before: 50% refund. Cancel within 24h or after the session occurs: no refund. Packages — Refundable within 48 hours of purchase if unused; refund minus a ¥1,000 (4-Pack) or ¥1,500 (8-Pack) cancellation/admin fee. After 48 hours or once any credit is used: non-refundable. No refunds after the validity period ends. Rescheduling is allowed up to 24 hours before start time. One credit is consumed per session held or if you cancel within 24 hours. Monthly Member Plan — For the first month only, if you request a refund within 24 hours of purchase and no lessons have been taken, we will cancel the subscription and provide a full refund for that month. After 24 hours, or once any lesson has been taken in the billing month, that month is non-refundable. You may cancel at any time before the next billing date to stop future charges; remaining hours can be used until the end of the current paid month, subject to the rollover rules described on the pricing page."
    },
    "defective": {
      "title": "Defective service / operational issues",
      "body": "If a lesson cannot be delivered due to our system or operational failure, contact support and we will provide a full refund or a free make-up session."
    }
  },

  "optional": {
    "applicationPeriod": { "label": "Application period", "value": "" },
    "quantity": { "label": "Available quantity / restrictions", "value": "" },
    "environment": { "label": "Operating environment (for software)", "value": "" }
  },

  "discounts": {
    "label": "Discounts",
    "value": "FIRST20: 20% off your first lesson (available for either standard or compact sessions). Not valid for package purchases. Can only be used once (cannot be used for both standard and compact sessions)."
  },
  "packages": {
    "label": "Packages (credits)",
    "value": "Each credit equals one session of the purchased type and duration (Standard: 60 minutes / Compact: 30 minutes). Schedule sessions anytime within the validity window. 4-Pack: valid 120 days; 8-Pack: valid 240 days. Credits are for the purchaser only and are not transferable."
  },
  "membership": {
    "label": "Monthly Member Plan (subscription)",
    "value": "The Monthly Member Plan is a subscription of ¥20,000 per month including 4 hours of lesson time. Hours can be used for any mix of 60-minute and 30-minute sessions (online or in-person, subject to the usual location conditions). The effective hourly rate is ¥5,000. Unused hours roll over to the following month, up to a maximum of 4 rollover hours. The subscription auto-renews each month until canceled via the Stripe customer portal or by contacting us. Members may book additional lessons at a discounted member rate of ¥4,800 per 60 minutes (or equivalent)."
  },
  "privacy": { "label": "Privacy policy", "value": "View Privacy Policy" }
}
